Revit 2024 API
CableTraySizes.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<MEPSize> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize)
Visual C++
public:
virtual IEnumerator<MEPSize^>^ GetEnumerator()
Return Value
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace